# Day 34 – Handling Datetime Columns in Machine Learning

Datetime columns are **not directly usable** by ML models.  
They must be transformed into meaningful numerical features that capture time-based patterns.

---

## Example Datetime Values
```text
2023-08-15
2023-08-15 14:32:10
2024-01-02 09:05:00

In [1]:
import pandas as pd
import numpy as np

In [2]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [4]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [7]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [8]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

 <!-- # 0   date        1000 non-null   object -->

##### note : you have to change the datatype from object to datetime

## Working with date

In [9]:
# Converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [10]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [ ]:
# date        1000 non-null   datetime64[ns]


1. Extract year

In [11]:
date['date_year'] = date['date'].dt.year

date.sample(5)

          date  product_id  city_id  orders  date_year
522 2019-10-30        2416       26       1       2019
790 2019-11-02        6369       23       1       2019
409 2018-09-07        6478        2       2       2018
270 2019-11-23         704       13      10       2019
165 2018-12-05         327       17       2       2018

2. Extract Month

In [14]:
date['date_month_no'] = date['date'].dt.month

date.sample(3)

          date  product_id  city_id  orders  date_year  date_month_no
614 2018-08-14        5941       25       2       2018              8
601 2019-11-24        6592       25      12       2019             11
752 2019-06-21        6174        3      12       2019              6

In [17]:
date['date_month_name'] = date['date'].dt.month_name()
# or use "dt.month" for month number extraction 
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
893,2018-08-02,1943,13,1,2018,8,August
13,2018-08-24,3020,13,4,2018,8,August
946,2018-11-10,6309,29,11,2018,11,November
787,2019-07-19,5371,22,8,2019,7,July
190,2019-07-13,776,13,2,2019,7,July

3. Extract Days

In [18]:
date['date_day'] = date['date'].dt.day
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day
5,2018-08-23,1811,25,4,2018,8,August,23
662,2019-07-08,6290,23,1,2019,7,July,8
656,2018-10-28,5687,13,15,2018,10,October,28
353,2018-08-08,2284,9,8,2018,8,August,8
921,2019-01-27,3995,18,31,2019,1,January,27

In [20]:
# day of week
date['date_dow'] = date['date'].dt.dayofweek

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [21]:
# day of week - name

date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [22]:
# is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

##### Extract week of the year

In [26]:
date['date_week'] = date['date'].dt.isocalendar().week

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

##### Extract Quarter

In [27]:
date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

#####  Extract Semester

In [28]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

##### Extract Time elapsed between dates

In [29]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2026, 1, 26, 5, 24, 38, 229111)

In [30]:
today - date['date']

0     2239 days 05:24:38.229111
1     2721 days 05:24:38.229111
2     2652 days 05:24:38.229111
3     2354 days 05:24:38.229111
4     2577 days 05:24:38.229111
                 ...
995   2667 days 05:24:38.229111
996   2608 days 05:24:38.229111
997   2456 days 05:24:38.229111
998   2521 days 05:24:38.229111
999   2295 days 05:24:38.229111
Name: date, Length: 1000, dtype: timedelta64[ns]

In [31]:
(today - date['date']).dt.days

0      2239
1      2721
2      2652
3      2354
4      2577
       ...
995    2667
996    2608
997    2456
998    2521
999    2295
Name: date, Length: 1000, dtype: int64

In [32]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, 'M'),0)

0      72.0
1      88.0
2      86.0
3      76.0
4      83.0
       ...
995    86.0
996    84.0
997    79.0
998    81.0
999    74.0
Name: date, Length: 1000, dtype: float64

### Working with time

In [37]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [34]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [36]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [38]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

##### Extract Time part

In [39]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

##### Time difference

In [40]:
today - time['date']

0     4425 days 04:34:38.229111
1     4289 days 05:44:38.229111
2     4775 days 05:03:38.229111
3     4077 days 04:53:38.229111
4     4474 days 06:13:38.229111
                 ...
995   5064 days 04:34:38.229111
996   4385 days 06:10:38.229111
997   4850 days 05:47:38.229111
998   4966 days 05:50:38.229111
999   4238 days 05:59:38.229111
Name: date, Length: 1000, dtype: timedelta64[ns]

In [41]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.823365e+08
1      3.705903e+08
2      4.125782e+08
3      3.522704e+08
4      3.865760e+08
           ...
995    4.375461e+08
996    3.788862e+08
997    4.190609e+08
998    4.290834e+08
999    3.661848e+08
Name: date, Length: 1000, dtype: float64

In [42]:

# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      6.372275e+06
1      6.176505e+06
2      6.876304e+06
3      5.871174e+06
4      6.442934e+06
           ...
995    7.292435e+06
996    6.314771e+06
997    6.984348e+06
998    7.151391e+06
999    6.103080e+06
Name: date, Length: 1000, dtype: float64

In [43]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      106204.577286
1      102941.743953
2      114605.060619
3       97852.893953
4      107382.227286
           ...
995    121540.577286
996    105246.177286
997    116405.793953
998    119189.843953
999    101717.993953
Name: date, Length: 1000, dtype: float64